{
  "main": {
    "name":"Ting Chung",
    "occupation":"aspiring software engineer",
    "description":"I am currently a Flatiron school student studying full-stack web development. I am formerly a aircraft systems engineer.",
    "image":"profilepic.jpg",
    "bio":"I am a Flatiron student studying full-stack web development. I was previously an aircraft systems engineer and now looking for a full-time position as a software developer.",
    "contactmessage":"If you would like more information, please contact me using the form below.",
    "email": "tchung682@gmail.com",
    "phone": "678-557-5088",
    "address":{
      "street":"113 Grimsby Rd",
      "city":"Savannah",
      "state":"GA",
      "zip": "31407"
    },
    "website": "https://tingchung.netlify.app/",
    "resumedownload":"https://docs.google.com/document/d/e/2PACX-1vQNq9l8QQYSqm0WL96oge0dE4wAur4SRFASCA3Hjuog6a2Q29333gCIpuuCj91tz71Ir61qSSjOcKwH/pub",
    "social":[
      {
        "name":"github",
        "url":"https://github.com/ting682",
        "className":"fab fa-github"
      },
      {
        "name":"dev",
        "url":"https://dev.to/ting682",
        "className":"fab fa-dev"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/ting-chung-92544b9/",
        "className":"fab fa-linkedin"
      }
      
    ]
  },
  "resume":{
    "skillmessage":"This is a list of my web development skills.",
    "education":[
      {
        "school":"Flatiron School",
        "degree":"Full-stack web development",
        "graduated":"projected to finish December 2020",
        "description":"Developed software development skills using Ruby, Ruby on Rails, Javascript, React, and Sinatra. Used languages and web frameworks to develop projects."
      },
      {
        "school":"Georgia Institute of Technology",
        "degree":"Electrical engineering",
        "graduated":"June 2007",
        "description":"Developed electronic design skills and learned hardware principles. Skilled in C++ for micro-controller unit designs. Matlab for digital signal processing."
      }
    ],
    "work":[
      {
        "company":"Gulfstream Aerospace Corporation",
        "title":"Technical Specialist I",
        "years":"May 2012 - May 2020",
        "description":"Implemented electrical design solutions for brakes, landing gear, hydraulics, and doors systems. Investigated and resolved flight test and lab issues through troubleshooting and integration testing. Developed validation and verification for brake control system requirements."
      },
      {
        "company":"Gulfstream Aerospace Corporation",
        "title":"Service Center Coordinator",
        "years":"September 2010 - May 2012",
        "description":"Co-manager of Chinese aircraft maintenance visits. Created and maintained work scope and project accomplishments. Chartered and monitored customer invoices."
      },
      {
        "company":"Universal Avionics Systems Corporation",
        "title":"Electrical Engineer",
        "years":"August 2008 - September 2010",
        "description":"Developed electronic hardware for line replaceable units including analog and digital circuitry, A429 ICs, LED drivers, analog-to-digital and digital-to-analog converters, and amplifiers. Designed circuit simulation models for analysis. Performed electromagnetic interference susceptibility testing."
      }
    ],
    "skills":[
      {
        "name":"Ruby",
        "level":"75%"
      },
      {
        "name":"Ruby on Rails",
        "level":"70%"
      },
      {
        "name":"Javascript",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"ReactJS",
        "level":"65%"
      },
      {
        "name":"PostgreSQL",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Small groups",
        "category":"This web app is built using Javascript and Rails API. This app is made for a user to submit bible study topics. The bible study topics can be revised via rich text format via Quill editor. A user can post the bible topic, add bible passages, and add comments to bible topics. For the frontend, this contains the classes that mirror the models for the backend for the user, topics, comments, and passages. This app uses CORS to communicate to the front end. Also, the authenticity of the posts are verified with JSON web tokens. The output of the JSON uses JSON fast API to serialize the data that is fetched.",
        "image":"http://img.youtube.com/vi/gzb9VecaUb0/0.jpg",
        "url":"https://smallgroups.netlify.app/"
      },
      {
        "title":"Prayer gathering",
        "category":"This is a Ruby on Rails app that is intended for a user to host a prayer gathering. This app includes validations for time and prayers to be submitted for the prayer gathering. The models use a many to many relationship for prayers and gatherings. Each gathering contains a meetup time that is validated with time zones and contains form fields for addresses which are stored in the postgreSQL database.",
        "image":"http://img.youtube.com/vi/6oR-F2Y6AvA/0.jpg",
        "url":"https://prayergathering.herokuapp.com/"
      },
      {
        "title":"Prayer Journal",
        "category":"This web app is used to create a journal for users to log in every day. This web app also contains a prayer wall so users can contribute prayers that they want everyone to pray for. ",
        "image":"http://img.youtube.com/vi/zZKlddr2upE/0.jpg",
        "url":"https://prayerjournals.herokuapp.com/"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
